import Main


def changedata():
    stationData = ['广州东站', '体育中心', '体育西路', '杨箕', '东山口', '烈士陵园', '农讲所', '公园前', '西门口',
                   '陈家祠', '长寿路', '黄沙', '芳村', '花地湾', '坑口', '西塱', '广州南站', '石壁', '会江', '南浦',
                   '洛溪', '南洲', '东晓南', '江泰路', '昌岗', '江南西', '市二宫', '海珠广场', '纪念堂', '越秀公园',
                   '广州火车站', '三元里', '飞翔公园', '白云公园', '白云文化广场', '萧岗', '江夏', '黄边', '嘉禾望岗',
                   '番禺广场', '市桥', '汉溪长隆', '大石', '厦滘', '沥滘', '大塘', '客村', '广州塔', '珠江新城',
                   '石牌桥', '岗顶', '华师', '五山', '天河客运站', '机场北', '机场南', '高增', '人和', '龙归',
                   '白云大道北', '永泰', '同和', '京溪南方医院', '梅花园', '燕塘', '林和西', '南沙客运港', '南横',
                   '塘坑', '大涌', '广隆', '飞沙角', '金洲', '蕉门', '黄阁', '黄阁汽车城', '庆盛', '东涌', '低涌',
                   '海傍', '石碁', '新造', '大学城南', '大学城北', '官洲', '万胜围', '车陂南', '车陂', '黄村', '滘口',
                   '坦尾', '中山八', '西场', '西村', '小北', '淘金', '区庄', '动物园', '五羊邨', '猎德', '潭村', '员村',
                   '科韵路', '东圃', '三溪', '鱼珠', '大沙地', '大沙东', '文冲', '浔峰岗', '横沙', '沙贝', '河沙',
                   '如意坊', '文化公园', '一德路', '北京路', '团一大广场', '东湖', '黄花岗', '沙河顶', '天平架', '长湴',
                   '植物园', '龙洞', '柯木塱', '高塘石', '黄陂', '金峰', '暹岗', '苏元', '萝岗', '香雪', '美的大道',
                   '北滘公园', '美的', '南涌', '锦龙', '陈村', '陈村北', '大洲', '谢村', '钟村', '南村万博', '员岗',
                   '板桥', '琶洲', '新港东', '磨碟沙', '赤岗', '鹭江', '中大', '晓港', '宝岗大道', '沙园', '凤凰新村',
                   '同福西', '华林寺', '彩虹桥', '鹅掌坦', '同德', '上步', '聚龙', '石潭', '小坪', '石井', '亭岗',
                   '滘心', '飞鹅岭', '花都汽车城', '广州北站', '花城路', '花果山公园', '花都广场', '马鞍山公园', '莲塘',
                   '清布', '清塘', '裕丰围', '双岗', '南海神庙', '夏园', '南岗', '沙村', '白江', '新塘', '官湖', '新沙',
                   '白云东平', '夏良', '太和', '竹料', '钟落潭', '马沥', '新和', '太平', '神岗', '邓村', '从化客运站',
                   '东风', '红卫', '新南', '枫下', '知识城', '何棠下', '旺村', '汤村', '镇龙北', '镇龙', '冼村', '龙潭',
                   '沙溪', '横沥', '万顷沙', '天河公园', '棠东', '大观南路', '天河智慧城', '神舟路', '科学城', '水西',
                   '长平', '金坑', '镇龙西', '中新', '坑贝', '凤岗', '朱村', '山田', '钟岗', '增城广场', '市广路',
                   '陈头岗', '体育中心南', '天河南', '黄埔大道', '妇儿中心', '花城大道', '大剧院', '海心沙', '新城东',
                   '东平', '世纪莲', '澜石', '魁奇路', '季华园', '同济路', '祖庙', '普君北路', '朝安', '桂城', '南桂路',
                   '礌岗', '千灯湖', '金融高新区', '龙溪', '菊树', '鹤洞', '沙涌', '燕岗', '石溪']
    for j in range(len(stationData)):
        start = stationData[0]
        end = stationData[j]
        Main.main(True, 0, start, end)
        Main.main(True, 1, start, end)
        print('测试已完成(%d/%d)\n' % (j + 1, 261))


if __name__ == '__main__':
    changedata()
